Конфигурация/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДоверительногоУправления</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитныйВклад</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаДоходовРасходов</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МНО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСМО</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>заполняется автоматически</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПортфелейСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПортфелейСтраховыхКомпаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РезервыПоСтрахованиюЖизни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервыПоСтрахованиюИномуЧемЖизни</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныеСредстваВРазмереНорматива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныеСредстваСверхНорматива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортфельВДоверительномУправлении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЛицевыеСчета/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Для Инд = 0 По ЭтотОбъект.СчетУчета.ВидыСубконто.Количество() - 1 Цикл
			
			ВидСубконто = ЭтотОбъект.СчетУчета.ВидыСубконто[Инд].ВидСубконто;
			
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги Тогда
				ЭтотОбъект.ЦеннаяБумага = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета Тогда
				ЭтотОбъект.БанковскийСчет = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДепозитныеВклады Тогда
				ЭтотОбъект.ДепозитныйВклад = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания Тогда
				ЭтотОбъект.ДоговорБрокерскогоОбслуживания = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				ЭтотОбъект.Договор = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				ЭтотОбъект.Контрагент = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОснованиеРасчетов Тогда
				ЭтотОбъект.ОснованиеРасчетов = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов Тогда
				ЭтотОбъект.ГруппаФинансовогоУчетаДоходовРасходов = ЭтотОбъект.ЭтотОбъект["Субконто" + Строка(Инд + 1)];
			КонецЕсли;	
		
		КонецЦикла;
		
		КодСчетаУчета = ЭтотОбъект.СчетУчета.Код;
		
		КодВалюты = ?(ЭтотОбъект.Валюта.Код = "643", "810", ЭтотОбъект.Валюта.Код);
		
		КодПризнакаДУ = "2";
		
		Если Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов Тогда
			КодВидаДоговораДУ = "3";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами Тогда
			КодВидаДоговораДУ = "2";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями Тогда
			КодВидаДоговораДУ = "1";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица Тогда
			КодВидаДоговораДУ = "0";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.Собственный Тогда
			КодВидаДоговораДУ = "0";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний Тогда
			КодВидаДоговораДУ = "0";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний Тогда
			КодВидаДоговораДУ = "0";
		ИначеЕсли Владелец.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.КонтрольСтраховыхКомпаний Тогда
			КодВидаДоговораДУ = "0";
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗначенияДополнительныхСведений.Значение
				|ИЗ
				|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
				|ГДЕ
				|	ЗначенияДополнительныхСведений.Свойство.Ключ = &Ключ
				|	И ЗначенияДополнительныхСведений.Объект = &Объект
				|	И ЗначенияДополнительныхСведений.Значение = &Значение";
			
			Запрос.УстановитьПараметр("Значение", Перечисления.ВидыПортфелейСтраховыхКомпаний.ПортфельВДоверительномУправлении);
			Запрос.УстановитьПараметр("Ключ", "СчетаДоверительногоУправления.КонтрольСтраховыхКомпаний.ВидПортфеляСтраховойКомпании");
			Запрос.УстановитьПараметр("Объект", Владелец);
			
			КодПризнакаДУ = "0";
			Если НЕ Запрос.Выполнить().Пустой() Тогда
			    КодПризнакаДУ = "2";
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен 10-й символ номера лицевого счета для вида договора ДУ "+Владелец.ВидДоговораДоверительногоУправления,,,,Отказ);
			КодВидаДоговораДУ = "0";
		КонецЕсли;	
		
		КодГФУ = "";
		Если ЗначениеЗаполнено(ЭтотОбъект.ГруппаФинансовогоУчетаДоходовРасходов) Тогда
			КодГФУ = ЭтотОбъект.ГруппаФинансовогоУчетаДоходовРасходов.Код;
		КонецЕсли;
		
		ПрефиксЛС = КодСчетаУчета + КодВалюты + КодПризнакаДУ + КодВидаДоговораДУ + КодГФУ;
		УстановитьНовыйКод(ПрефиксЛС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//уберем наименование, т.к. оно заполнится в ПриЗаписи
	ГдеНаименование = ПроверяемыеРеквизиты.Найти("Наименование");
	Если ЭтоНовый() И ГдеНаименование<>Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ГдеНаименование);
	КонецЕсли;
	
КонецПроцедуры
